<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="LibreOffice 3.6  (Windows)">
	<META NAME="CREATED" CONTENT="20121211;21045381">
	<META NAME="CHANGED" CONTENT="20121211;21264520">
	<STYLE TYPE="text/css">
	<!--
		@page { margin: 2cm }
		P { margin-bottom: 0.21cm }
	-->
	</STYLE>
</HEAD>
<BODY LANG="es-MX" DIR="LTR">
<P STYLE="margin-bottom: 0cm"><FONT COLOR="#004586"><FONT SIZE=4 STYLE="font-size: 16pt"><B>Explorador
DP</B></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-weight: normal"><FONT COLOR="#000000"><FONT SIZE=3>El
explorador DP te permite explorar la din&aacute;mica ca&oacute;tica
del doble p&eacute;ndulo. En esta misma se basa el fractal de doble
p&eacute;ndulo</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-weight: normal"><FONT COLOR="#000000"><FONT SIZE=3>Selecciona
un punto en la imagen haciendo click y luego haga click en el bot&oacute;n
<B>lanzar simulaci&oacute;n </B>para ver la animaci&oacute;n de un
p&eacute;ndulo doble.</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-weight: normal"><FONT COLOR="#000000"><FONT SIZE=3>Al
abrir la ventana aparecer&aacute; un mapa de doble p&eacute;ndulo
predefinido, pero se puede cargar nuevos mapas guardando una imagen
del p&eacute;ndulo doble (en formato BMP) y luego carg&aacute;ndolos
en la ventana del explorador DP.</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-weight: normal"><FONT COLOR="#000000"><FONT SIZE=3>Pero
antes, &iquest;qu&eacute; es el mapa de p&eacute;ndulo doble?</FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-weight: normal"><IMG SRC="dpTut_html_342556f1.png" NAME="graphics1" ALIGN=LEFT WIDTH=321 HEIGHT=274 BORDER=0><BR CLEAR=LEFT><FONT COLOR="#000000"><FONT SIZE=3>El
p&eacute;ndulo d<SPAN LANG="es-MX">oble es un sistema formado por dos
p&eacute;ndulos como los que se muestran en la figura. Cada p&eacute;ndulo
tiene un &aacute;ngulo inicial &theta;1 y &theta;2. Entonces dejamos
que los p&eacute;ndulos se muevan &iexcl;y sorpresa! El movimiento
del p&eacute;ndulo es completamente ca&oacute;tico. Para graficar la
din&aacute;mica ca&oacute;tica del movimiento del p&eacute;ndulo
podemos hacer un mapa donde grafiquemos el resultado del movimiento
del doble p&eacute;ndulo respecto a los &aacute;ngulos iniciales. En
el fractal del doble p&eacute;ndulo lo que se hace es ver si alguna
de las pasas da la vuelta (lo que significa un &aacute;ngulo mayor a
180&deg;). Si no da la vuelta se marca el pixel como negro, si da la
vuelta entonces se colorea de acuerdo al tiempo que le tom&oacute;
voltearse. De este procedimiento se obtiene una imagen como esta:</SPAN></FONT></FONT></P>
<P STYLE="margin-bottom: 0cm; font-weight: normal"><IMG SRC="dpTut_html_50448500.png" NAME="graphics2" ALIGN=LEFT WIDTH=341 HEIGHT=219 BORDER=0><BR CLEAR=LEFT><BR>
</P>
<P STYLE="margin-bottom: 0cm; font-weight: normal"><FONT COLOR="#000000"><FONT SIZE=3><SPAN LANG="es-MX">El
explorador DP te permite visualizar este movimiento dependiendo de
los &aacute;ngulos iniciales.</SPAN></FONT></FONT></P>
</BODY>
</HTML>